Revit 2027 API
IDuctFittingAndAccessoryPressureDropServer.GetDataSchema Method
 Obtains the schema of the ESEntity.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
Schema GetDataSchema()
Function GetDataSchema As Schema
Schema^ GetDataSchema()
abstract GetDataSchema : unit -> Schema
Return Value
Schema
 Null if the server has no data.
See Also
Reference
IDuctFittingAndAccessoryPressureDropServer Interface
Autodesk.Revit.DB.Mechanical Namespace